Terraform plan for __dev__
<details>
  <summary>Plan: 7 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_sql_database.additional_databases["stestdb"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "ibo-dev-db-78c73acd"
      + name      = "stestdb"
      + project   = "ebo-dev-321910"
      + self_link = (known after apply)
    }

  # google_sql_database.additional_databases["testdb"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "ibo-dev-db-78c73acd"
      + name      = "testdb"
      + project   = "ebo-dev-321910"
      + self_link = (known after apply)
    }

  # google_sql_user.additional_databases["stestdb"] will be created
  + resource "google_sql_user" "additional_databases" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "ibo-dev-db-78c73acd"
      + name     = "stestuser"
      + password = (sensitive value)
      + project  = "ebo-dev-321910"
    }

  # google_sql_user.additional_databases["testdb"] will be created
  + resource "google_sql_user" "additional_databases" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "ibo-dev-db-78c73acd"
      + name     = "tesruser"
      + password = (sensitive value)
      + project  = "ebo-dev-321910"
    }

  # kubernetes_secret.additional_databases["stestdb"] will be created
  + resource "kubernetes_secret" "additional_databases" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "stestsecret"
          + namespace        = "stestnamespace"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.additional_databases["testdb"] will be created
  + resource "kubernetes_secret" "additional_databases" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "testsecret"
          + namespace        = "testnamespace"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_string.random_password_create will be created
  + resource "random_string" "random_password_create" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # module.istio_telemetry_proxy[0].helm_release.istio_telemetry_proxy will be updated in-place
  ~ resource "helm_release" "istio_telemetry_proxy" {
      ~ chart                      = "/github/home/.dflook-terraform-data-dir/modules/istio_telemetry_proxy/addons/istio-telemetry-proxy/chart" -> "/tmp/terraform-data-dir/modules/istio_telemetry_proxy/addons/istio-telemetry-proxy/chart"
        id                         = "istio-telemetry-proxy"
        name                       = "istio-telemetry-proxy"
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #219](https://github.com/ebomart/commerce-infrastructure/actions/runs/1304780205)